In [1]:
%load_ext sql
%sql mysql://root:password@localhost/pizza_project

In [2]:
%%sql
SHOW TABLES;

 * mysql://root:***@localhost/pizza_project
13 rows affected.

[('customer',),
 ('customerdiscount',),
 ('delivery',),
 ('deliveryperson',),
 ('dessert',),
 ('discountcode',),
 ('drink',),
 ('earningsreport',),
 ('ingredient',),
 ('order',),
 ('orderitem',),
 ('pizza',),
 ('pizzaingredient',)]

In [3]:
%%sql
DESC Dessert;

 * mysql://root:***@localhost/pizza_project
3 rows affected.

[('DessertID', 'int', 'NO', 'PRI', None, 'auto_increment'),
 ('Name', 'varchar(255)', 'YES', '', None, ''),
 ('Price', 'decimal(10,2)', 'YES', '', None, '')]

In [4]:
%%sql
SELECT * FROM Dessert;
DESC Dessert;

 * mysql://root:***@localhost/pizza_project
5 rows affected.
3 rows affected.

[('DessertID', 'int', 'NO', 'PRI', None, 'auto_increment'),
 ('Name', 'varchar(255)', 'YES', '', None, ''),
 ('Price', 'decimal(10,2)', 'YES', '', None, '')]

In [5]:
%%sql
SELECT * FROM Ingredient LIMIT 5;

 * mysql://root:***@localhost/pizza_project
5 rows affected.

[(1, 'Cheese', Decimal('0.50')),
 (2, 'Pepperoni', Decimal('1.00')),
 (3, 'Mushrooms', Decimal('0.75')),
 (4, 'Olives', Decimal('0.75')),
 (5, 'Pineapple', Decimal('0.75'))]

In [6]:
%%sql
SELECT * FROM `order`;

 * mysql://root:***@localhost/pizza_project
(MySQLdb.ProgrammingError) (1064, "You have an error in your SQL syntax; check the manual that corresponds to your MySQL server version for the right syntax to use near ''order'' at line 1")
[SQL: SELECT * FROM 'order';]
(Background on this error at: https://sqlalche.me/e/20/f405)